[
    {
        "id": 0,
        "activities_text_data": "\nDevRelJam Bengaluru was a blast 🎉On April 22nd, we brought together 40+ Developer Relations professionals on the sidelines of GIDS 2025 to share stories, learnings, and a whole lot of real talk about the evolving world of DevRel.Here’s what went down:👋 We kicked off with Ram Iyengar sharing the complexities (and fun) of DevRel job titles with his session “The Devil Is in the Titles”💬 A candid Ask Me Anything session featuring James Ward, Ivar Grimstad, and Sourabh Bagrecha, answering questions like:- What’s one non-technical skill that’s shaped your DevRel journey?- How is AI changing the DevRel landscape, and what new skills do we need?- James also shared insights from his blog \"The Seven Artifacts of Developer Advocacy Projects\"🎯 Then came Stephen Chin with a deep dive into “The Engaged Developer Funnel”, redefining how we measure value and success 🥑 🙏 Big thanks to the amazing team at Contentstack for sponsoring this event and making it happen.📢 Next up: DevRelJam Hyderabad — happening August 7, 2025, on the sidelines of hashtag#KubeCon India. Stay tuned!hashtag#DevRelJam hashtag#DeveloperRelations hashtag#DevRel hashtag#DeveloperCommunity\n"
    },
    {
        "id": 1,
        "activities_text_data": "\nDevSphere is launching a hackathon for makers like you.no themes. no fluff. just build real stuff with notion as your backend.👾 solo or team (up to 4)🧠 build anything useful🗓️ deadline: April 7, 11:30pm🏆 winners get notion pro + ai access for life (as long as you’re in DevSphere)everyone registers individually here:🔗 https://lu.ma/eyu9kpwqwe’ll send a form later to collect team + github links.but for now — just say yes.hit that link.and start building.\n"
    },
    {
        "id": 2,
        "activities_text_data": "\n'Transforming healthcare delivery through digital health ecosystems: Can Ayushman Bharat Digital Mission (ABDM) bridge gaps in accessibility, affordability and equity?' was the focus of my talk at the Development Policy and Practice Conference 2025 in Hyderabad. ABDM  has five digitisation programs: Ayushman Bharat Health Account1) Ayushman Bharat Health Account (ABHA); 2) ABHA mobile App; 3) Health Facility Registry (HFR); 4) Health Care Professional Registry; and 5) Unified Health Interface (UHI). I ask given the federal democratic structure in India, the poor spending in the public health sector and the huge burden of out-of-pocket expenditure by the individuals, can ABDM be a game-changer in restructuring the health sector in India? Can ABDM meet the expectation of improving health care delivery, the health-sector decision-making at the macro-level, as well as provide patients with access to safe longitudinal medical records that can be shared across health providers in the public and private sectors? Finally, can it help achieve 'health for all', leaving no one behind?In my talk I critiqued the techno-deterministic perspective and offered a provocation  - With the digitisation of everything becoming rampant, what does this mean for digital inclusion, and how can exclusion be addressed?Digital Health can also exacerbate existing health disparities or introduce new barriers for socially disadvantaged groups. The ABDM has the potential to improve accessibility and equity in the long run, however, several implementation challenges need to be addressed urgently to enable this to be a game-changer in the digital health ecosystem to facilitate accessibility and equity. Implementation challenges include adoption, limited infrastructure, technological barriers, digital illiteracy and skills gaps, privacy and data protection concerns, financial and regulatory burdens etc etc. To conclude: We have a long way to go.Dr. Pushkarni PanchamukhiProfessor Dwarika UniyalRV UniversitySchool of Economics and Public Policy RVU\n"
    },
    {
        "id": 3,
        "activities_text_data": "\nEver felt like your social media feed just gets you? Like it knows exactly what you want to see before you even think about it?Yeah… that’s not magic. That’s the algorithm.It curates your reality, deciding what you see, who you interact with, and what you believe to be true. Feels convenient, right? But also kinda terrifying.The question is, who’s in control? You or the algorithm?I put together some insights into how these platforms manipulate what we see, think, and feel. It's all in the PDF below.Drop your thoughts in the comments, do you think we can actually break out of these filter bubbles? Or are we too deep in?Would love to hear your take =)hashtag#socialmedia Priyanka Suresh, Ph.D.\n"
    },
    {
        "id": 4,
        "activities_text_data": "\nURGENT HELP: ANYONE HIRING GRAPHIC DESIGNERS?If anyone in my network is hiring junior designers, please take a look at Anandita Wagh's resume.Anandita and I worked together over all the design collaterals for DevRelCon Bengaluru last December, and she delivered exceptional work in a very short timeline. She has 2+ years of freelance graphic design experience and worked at IKEA for 6 months as a visual merchandiser and store designer (had to leave due to certain unforeseeable circumstances).📍 Preferred location: Bengaluru/remote (open to other locations too)💼 Roles: Graphic Designer, UI/UX Design (doesn't have formal experience but is willing to learn)🗓️ Start date: Immediate joinerIf your team is currently looking for a sincere, diligent, and creative individual for your design team, please DM Anandita Wagh or comment below with any necessary details. Else, please share with your network 🙏Edit: She started a new job a little while back! Thank you to everyone who helped out ❤️\n"
    },
    {
        "id": 5,
        "activities_text_data": "\nHappy 1 year to us!!Here's to many more.hashtag#Devsphere #hashtag#rvuniversity #hashtag#opensource hashtag#buildtogether hashtag#happybirthday\n"
    },
    {
        "id": 6,
        "activities_text_data": "\nDo you have what it takes to be a DevSphere apprentice?sign up now at https://lnkd.in/g_5VrSx8cohort 1 starts today.\n"
    },
    {
        "id": 7,
        "activities_text_data": "\nwe’ve grown. we’ve learned. we’ve built.a very happy 1st birthday to us!!we're shipping something new tomorrow!hashtag#DevSphere hashtag#RVUniversity hashtag#OpenSource\n"
    },
    {
        "id": 8,
        "activities_text_data": "\nI’ve been reflecting on the Decentralized Intelligence session I attended recently. It was insightful to learn how AI is transforming our interaction with smart contracts and how easily we can now develop decentralized apps using simple prompts. The concept of integrating AI with smart contracts to stimulate dynamic interactions is truly exciting for the future of Web3.Thank you Roshann Vadassery, Taufeeq Riyaz and team, for organizing such an event.\n"
    },
    {
        "id": 9,
        "activities_text_data": "\nWe just wrapped up Decentralized Intelligence by Devsphere and Tenacity, an informative session exploring AI in smart contracts and the future of AI x Web3! We dove into how AI is revolutionizing smart contracts and discussed real world AI x Web3 use cases.Huge thanks to Roshann Vadassery for the insightful session. I was truly surprised by the impressive results generated by widecanvas.ai and openputer.com.I'm super grateful to our amazing faculty advisors, Dr Nikita Singh and Dr Merin Thomas, for their guidance and support as always! A special shoutout to the Media and Logistics team (Yashmeet Baid, Kautilya D K, Freya Raja, Pushan Thimmegowda, Mitul KM, Mehul Goyal, and Megh Mavani) for making it all come together smoothly.RV University hashtag#Web3 hashtag#AI hashtag#Blockchain hashtag#Innovation hashtag#DecentralizedIntelligence\n"
    },
    {
        "id": 10,
        "activities_text_data": "\nThank you Roshan for the session Decentralized Intelligence -AI x Web 3 at RV University\n"
    },
    {
        "id": 11,
        "activities_text_data": "\nWe just wrapped up Decentralized Intelligence by Devsphere and Tenacity, an informative session exploring AI in smart contracts and the future of AI x Web3! We dove into how AI is revolutionizing smart contracts and discussed real world AI x Web3 use cases.Huge thanks to Roshann Vadassery for the insightful session. I was truly surprised by the impressive results generated by widecanvas.ai and openputer.com.I'm super grateful to our amazing faculty advisors, Dr Nikita Singh and Dr Merin Thomas, for their guidance and support as always! A special shoutout to the Media and Logistics team (Yashmeet Baid, Kautilya D K, Freya Raja, Pushan Thimmegowda, Mitul KM, Mehul Goyal, and Megh Mavani) for making it all come together smoothly.RV University hashtag#Web3 hashtag#AI hashtag#Blockchain hashtag#Innovation hashtag#DecentralizedIntelligence\n"
    },
    {
        "id": 12,
        "activities_text_data": "\nhappy to announce that I've been recognized in 20Under20 by Infosys Infosys Springboard under the Entrepreneurship category :)I'm very grateful to Riyaz Nune, Sanjay Chitnis, Dr.Mydhili K Nair, Murthy Y.S.R., Nagaraj devatha and Dr Nikita Singh for supporting and believing in me during my last 2 years.\n"
    },
    {
        "id": 13,
        "activities_text_data": "\nI am thrilled to announce the completion of my Executive MBA at Dayananda Sagar University - SCMS, Bangalore, yesterday!This journey has been nothing short of incredible, marked by intense learning from high-profile and dedicated professors at DSU. Over 20 months, 16 subjects, 10+ assignments, 200+ case studies, participated in 22 campus immersions, and culminated my studies with a challenging Capstone project. This rigorous experience has honed my knowledge and skills, preparing me for the complexities of the VUCA world.I will fondly remember the late-night study sessions, engaging group discussions, and the profound insights shared by our professors as they unraveled complex cases, offering diverse perspectives.My heartfelt gratitude to our Management, Shashank MP - Managing Director of MAG India whose encouragement was invaluable. I am deeply thankful to Capt. A. Nagaraj Subbarao, PhD, the Dean of the School of Commerce and Management Studies, Taufeeq Riyaz, the driving force in my MBA journey.I owe a debt of gratitude to the DSU professors, faculty members, and staff, as well as my batchmates, whose knowledge-sharing enriched my learning experience and empowered me as a leader.I am also indebted to my family for their unwavering support throughout this journey.This journey has been as rewarding as reaching the destination itself. I am eagerly anticipating, filled with a heightened sense of responsibility to contribute meaningfully to both my organization and society at large.Dr .solai Baskaran,Ph.D(I I T) Prof.Mohan Srinivasan ,Prof. Amulya Panda, Prof Jitendranath Patri,Prof. Karthik Guruvaidyanathan ,Prof. Karunakara Kudupu\n"
    },
    {
        "id": 14,
        "activities_text_data": "\nI’m happy to share that I’m starting a new position as Intern at Tenacity! Can’t wait to work with this enthusiastic team of people.\n"
    },
    {
        "id": 15,
        "activities_text_data": "\n📢 Tenacity is now the official community partner for FOSS United IndiaFOSS 3.0 And guess what? 🤔 Students, we've got a special treat for you! 🎓📚Get your tickets at a massive 50% OFF! 🎟️Register now -indiafoss.net/2023\n"
    },
    {
        "id": 16,
        "activities_text_data": "\nWe kicked off the 10th Hacktoberfest, the largest celebration of open source in the world 🎉A huge shoutout to everyone who joined DigitalOcean and Appwrite for the kickoff event!🎤 Kudos to our fantastic speakers - Aditya Oberai, Karan M.V., Aaishika S Bhattacharya, Khushboo Verma, and Ashwin Kumar UppalaAs part of the Hacktoberfest, we at Tenacity are making our repositories open-source on GitHub so that everyone can contribute to them. Open source has always been at the heart of our mission at Tenacity, and we believe that by opening up our code to the community, we can foster collaboration, creativity, and innovation in ways we never imagined. If you're a college student, feel free to reach out, let's organize an event promoting open source at your campus!\n"
    },
    {
        "id": 17,
        "activities_text_data": "\nThankyou Tenacity and Taufeeq Riyaz for having me on-board. Very excited for what the future holds !\n"
    },
    {
        "id": 18,
        "activities_text_data": "\nThankyou Tenacity and Taufeeq Riyaz for having me on-board. Very excited for what the future holds !\n"
    },
    {
        "id": 19,
        "activities_text_data": "\nI’m happy to share that I’m starting a new position as Technical Lead at Tenacity!I'm truly grateful to Taufeeq Riyaz for this opportunity. I look forward to collaborating with a talented team, leveraging my skills and expertise, and making a positive impact.I am very excited about the journey ahead and the chance to make meaningful contributions to Tenacity's mission. hashtag#TechnicalLead hashtag#Tenacity hashtag#grateful\n"
    },
    {
        "id": 20,
        "activities_text_data": "\nhaha! cool things happening at Tenacity. Can't wait for everyone to see it. Shoutout to Daiwik Reddy who joined us while he was traveling🥹\n"
    },
    {
        "id": 21,
        "activities_text_data": "\nPOV - Your relatives are leaving after staying with you for a few days and you're waiting for them to give you that sweet piece of paper with Gandhiji on it.Cool things are happening at Tenacity and we can't wait for you guys to see it! Get excited!hashtag#education hashtag#career\n"
    },
    {
        "id": 22,
        "activities_text_data": "\nUnlock your potential and join a community of ambitious students at Tenacity. Where diversity, mentorship, and opportunity come together to help you achieve your goals. hashtag#TenacityCommunity\n"
    },
    {
        "id": 23,
        "activities_text_data": "\nI'm pleased to announce the successful completion of the \"Transitioning from Web 2.0 to Web 3.0 Learnathon\" at RV University. The event included a hackathon where students were able to build websites and attend blockchain 101 sessions. The main goal was to expose students to the latest developments in web 3 technology, including decentralization and blockchain.We also introduced Tenacity, a student-driven community that provides an inclusive and collaborative space for all. Our main goal at Tenacity is to help students find what they love and learn it for free from their peers or from industry experts through sessions like these.I would like to express my gratitude to Sanjay Chitnis sir for his support in making learning more interesting and helping students find what they love. I would also like to thank Rabble Devs and Shardeum for their support of the event and for providing swags/prizes to the winners.Tanmay Tarte I really loved your session and was really impressed by how you made the session very interactive even though you couldn't join us in person, got to learn a lot about speaking about events from you! krishna Dvaipayan Thank you for the amazing session on Shardeum and for supporting the event as well. Looking forward to conducting more such sessions with you and Bob Dao.I would also like to thank Sudarshan Bhat sir and Sahanan ma'am for their support.Congratulations to all the winners of the hackathon and quiz. The energy and enthusiasm of RV University students were truly impressive. Please reach out to me anytime to learn further about blockchain or any other field of interest, if I am not able to guide you, I will at least try my best to find someone who can help you.I'm looking forward to future opportunities to bring learning and innovation to RV University and Tenacity.hashtag#blockchain hashtag#web3 hashtag#webdevelopment hashtag#hackathon\n"
    },
    {
        "id": 24,
        "activities_text_data": "\nAmazing event by Showwcase today. It was a great experience meeting and learning from such incredible people. hashtag#showwcase hashtag#showwcasefusion\n"
    },
    {
        "id": 25,
        "activities_text_data": "\ncompleted hashtag#journey2salesforce last month and received my first set of developer swags. thank you Salesforce for this :) hashtag#salesforce\n"
    },
    {
        "id": 26,
        "activities_text_data": "\nThe last three months have been an incredible journey because I got to be a part of the Spenny team. I got to work and learn with some of the best minds in the startup ecosystem.Special thanks to Rathin Shah Mihir Aggarwal Anurag Dixit and the Spenny team for this amazing opportunity.hashtag#startup hashtag#spenny\n"
    },
    {
        "id": 27,
        "activities_text_data": "\nGlad to be joining Spenny as Chief Experiment Officer. Looking forward to learn and grow with the best minds :)Thank you Spenny and Mihir Aggarwal for this opportunity.\n"
    }
]