[
    {
        "id": 0,
        "profile_text_data": "\nTaufeeq Riyaz\nBuilding Tenacity | 20Under20 2024 | Looking For Talented Individuals For Tenacity Team | Founding President at DevSpehre | Tech Enthusiast\nDevsphere\nY Combinator\nIndia\nContact info\n1,975 followers\n500+ connections\nFollow\nMessage\nMore\nSend profile in a message\nSave to PDF\nConnect\nReport / Block\nAbout this profile\nAbout this profile\n"
    },
    {
        "id": 1,
        "profile_text_data": "\nAbout\nHey! I'm Taufeeq Riyaz, and I'm interested in computer science, technology, design, astronomy, business, and marketing. I'm constantly keen to learn new things and take on new challenges. I continuously look for opportunities to use my knowledge and experience to grow as an individual and provide value to the people around me.\nTop skills\nMarketing • Community Outreach • Community Development\n"
    },
    {
        "id": 2,
        "profile_text_data": "\nFeatured\nArticle\nWhy India Isn't Ready for EdTech\nTaufeeq Riyaz on LinkedIn\nI remember sitting in my class during lunch break in my 11th grade, watching a group of my classmates hunched over their phones. Their screens flashed with complex equations and mock test results. Curious, I struck up a conversation with one of them, a 17 year old (Let's name him Chintu) preparing for the IIT-JEE. He told me about the countless hours he spent on an EdTech app that promised him a top rank. Yet, when I asked him if he enjoyed what he was studying or if he understood the concepts deeply, he hesitated. \"It's not about enjoyment,\" he said. \"It's about getting that rank.\" The Dream Sellers of Education Here’s a snapshot of the homepage of one of India’s leading EdTech startups. What do you see? For me, it’s not just a pitch for courses, it’s a promise of dreams. But here’s the thing, are we selling education, or are we selling the fear of falling behind? India's education landscape has always been competitive, but the rise of EdTech has turned it into a marketplace of dreams. Coaching institutes once held the monopoly on promising top exam ranks and prestigious college admissions. Now, EdTech companies have taken over, leveraging technology to amplify these promises. They sell not just courses but aspirations, cracking the IIT-JEE, acing the NEET, or landing a high-paying job after a short program. These platforms are masterful at tapping into the fears and hopes of students and parents alike. The fear of being left behind. The hope of a secure future. In a society where academic achievement is often equated with self worth, it's a powerful strategy. But here’s the uncomfortable truth - it’s rarely about actual learning. Forget critical thinking or creativity, what sells is rote memorization, test hacks, and shortcut culture. Real-world skills? Who’s got time for that when rankings are on the line? At Tenacity, we’ve seen this struggle up close. We’ve tried to flip the narrative, focused on personalized learning, practical skills, and creating a love for knowledge. Sounds good on paper, right? But then you hear questions like, “How quickly can I get a job?” or “Will this help me rank higher?” And you realize how deeply ingrained this outcome driven mindset is. It’s not entirely EdTech’s fault. In India, education equals results. Parents don’t see it as nurturing intellect, they see it as securing a future. And honestly? That’s valid. But it’s a short-term play that sidelines the stuff that really matters - problem-solving, adaptability, creativity. It ignores the development of problem-solving abilities, adaptability, and the soft skills that are crucial in today's rapidly changing world. Let's go back to the 17 year old Chintu I told about earlier. Despite using multiple EdTech platforms, he confessed that he often felt overwhelmed and unfulfilled. \"I can solve complex problems, but sometimes I don't understand why I'm doing it,\" he admitted. \"I worry that once the exams are over, I won't know what's next.\" His uncertainty highlights a significant issue. When education is reduced to a means to an end, students may achieve short term goals but are ill prepared for long term success and fulfillment. The Reality Check Most EdTech companies, in their race to the top, have forgotten the essence of education. By selling dreams and quick fixes, they're not just shortchanging students like Chintu but also contributing to a workforce that lacks critical competencies. Moreover, this model isn't sustainable. As more students and parents recognize the gap between promises and reality, trust in these platforms diminishes. It's a cycle that ultimately hinders progress in the education sector. India's readiness for a true EdTech revolution is hampered by cultural expectations and systemic issues. Until there's a collective shift in how we perceive education, i.e. valuing learning over ranking, the cycle will continue. I had a wake up call recently after meeting Harnidh Kaur (Head of WTFund) at a GenShe event. She didn’t sugarcoat it - students in India aren’t ready for real EdTech yet. There’s a cultural reset needed, one that values learning over rankings, skills over shortcuts. Until then, the cycle continues. And here’s where Tenacity comes in. We’re making some hard decisions, suspending two products to focus entirely on our learning platform. It’ll stay free, open source, not-for-profit, and community-driven. Why? Because we believe education isn’t about selling dreams, it’s about building futures that last. There’s a fine line between being optimistic and being straight-up delusional, especially when you’re building something in the chaotic world of entrepreneurship. In India’s EdTech scene, that line? It’s blurry. Real blurry. A lot of founders have these big, dreamy visions of “revolutionizing education.” Sounds awesome, right? But here’s the thing, dreams don’t pay the bills or solve real-world problems unless they’re grounded in reality. Ignoring market challenges and practical constraints? That’s where optimism slips into delusion. It’s not about thinking small, it’s about building smart. The market is unforgiving, but if you get it right, the impact you can make is massive. Cheers! Taufeeq Riyaz\nPost\nhappy to announce that I've been recognized in 20Under20 by Infosys Infosys Springboard under the Entrepreneurship category :)I'm very grateful to Riyaz Nune, Sanjay Chitnis, Dr.Mydhili K Nair, Murthy Y.S.R., Nagaraj devatha and Dr Nikita Singh for supporting and believing in me during my last 2 years. \n195                    \n45 comments\nPost\nHad an amazing time diving deep into the world of Web3 with the incredible community at Web3Camp 2023 by the GirlScript Foundation!  🚀 We explored the intricate weave of Web3 buzzwords and unlocked the transformative potential of Decentralized Finance (DeFi).A big shoutout to the GirlScript Foundation team for putting together such a seamless and inspiring event!Special thanks to Yati Padia and Keerthana M S for making the event possible.Couldn't make it live? you can find the link to the slides in the comments below🔗hashtag#Web3Camp2023 hashtag#GirlscriptFoundation hashtag#DeFi hashtag#Blockchain\n121                    \n5 comments\nPost\nHad an amazing time organizing the \"Getting Started With Open Source and Making Your First PR in Hacktoberfest 2023\" event. It was a great opportunity to celebrate open-source software and inspire contributions from our talented RV University students 💻Thank you Ashutosh Jha for conducting the open source workshop. Your insights and guidance were invaluable! ✨️My deepest gratitude to Sanjay Chitnis sir, Thotreithem Hongray sir and Kusuma Nagesh ma'am for their consistent support in making this possible 🙏A heartfelt thank you to our incredible volunteering team (Daiwik Reddy, Pushan T, Aniruddha, Yashmeet Baid) for making the event a success 🙌\n85                    \n6 comments\nPost\nWe kicked off the 10th Hacktoberfest, the largest celebration of open source in the world 🎉A huge shoutout to everyone who joined DigitalOcean and Appwrite for the kickoff event!🎤 Kudos to our fantastic speakers - Aditya Oberai, Karan M.V., Aaishika S Bhattacharya, Khushboo Verma, and Ashwin Kumar UppalaAs part of the Hacktoberfest, we at Tenacity are making our repositories open-source on GitHub so that everyone can contribute to them. Open source has always been at the heart of our mission at Tenacity, and we believe that by opening up our code to the community, we can foster collaboration, creativity, and innovation in ways we never imagined. If you're a college student, feel free to reach out, let's organize an event promoting open source at your campus!\n137                    \n1 comment\n"
    },
    {
        "id": 3,
        "profile_text_data": "\nActivity\n1,975 followers\nFollow\nPosts\nComments\nVideos\nImages\nArticles\nDocuments\nLoaded 9 Posts posts\nTaufeeq Riyaz reposted this\nYashraj Nayak\n• 3rd+Premium • 3rd+\nProgram Manager, GitHub Developer Relations\n2mo • \n2 months ago • Visible to anyone on or off LinkedIn\nDevRelJam Bengaluru was a blast 🎉On April 22nd, we brought together 40+ Developer Relations professionals on the sidelines of GIDS 2025 to share stories, learnings, and a whole lot of real talk about the evolving world of DevRel.Here’s what went down:👋 We kicked off with Ram Iyengar sharing the complexities (and fun) of DevRel job titles with his session “The Devil Is in the Titles”💬 A candid Ask Me Anything session featuring James Ward, Ivar Grimstad, and Sourabh Bagrecha, answering questions like:- What’s one non-technical skill that’s shaped your DevRel journey?- How is AI changing the DevRel landscape, and what new skills do we need?- James also shared insights from his blog \"The Seven Artifacts of Developer Advocacy Projects\"🎯 Then came Stephen Chin with a deep dive into “The Engaged Developer Funnel”, redefining how we measure value and success 🥑 🙏 Big thanks to the amazing team at Contentstack for sponsoring this event and making it happen.📢 Next up: DevRelJam Hyderabad — happening August 7, 2025, on the sidelines of hashtag#KubeCon India. Stay tuned!hashtag#DevRelJam hashtag#DeveloperRelations hashtag#DevRel hashtag#DeveloperCommunity\n…more\nActivate to view larger image,\n1/9\nActivate to view larger image,\n161                    \n3 comments\n8 reposts\nTaufeeq Riyaz reposted this\nDevsphere\n43 followers\n2mo • \n2 months ago • Visible to anyone on or off LinkedIn\nDevSphere is launching a hackathon for makers like you.no themes. no fluff. just build real stuff with notion as your backend.👾 solo or team (up to 4)🧠 build anything useful🗓️ deadline: April 7, 11:30pm🏆 winners get notion pro + ai access for life (as long as you’re in DevSphere)everyone registers individually here:🔗 https://lu.ma/eyu9kpwqwe’ll send a form later to collect team + github links.but for now — just say yes.hit that link.and start building.\n…more\nActivate to view larger image,\nActivate to view larger image,\n12                    \n3 reposts\nShow all posts\n"
    },
    {
        "id": 4,
        "profile_text_data": "\nExperience\nDevsphere\nFull-time · 1 yr 7 mos\nAdvisor\nJun 2025 - Present · 2 mosJun 2025 to Present · 2 mos\nFounder and President\nJan 2024 - Jun 2025 · 1 yr 6 mosJan 2024 to Jun 2025 · 1 yr 6 mos\nBengaluru, Karnataka, India · Hybrid\nCurating educational experiences (boot camps, workshops, and hackathons) for RV University students in the field of blockchain and open source.\n1000068641.jpg\nFounder And Design Lead\nTenacity · Full-time\nDec 2022 - Present · 2 yrs 8 mosDec 2022 to Present · 2 yrs 8 mos\nBengaluru, Karnataka, India\nAs the founder of Tenacity, I am responsible for managing all aspects of the product and community, including the technology and design end. I take great care to ensure that the community runs smoothly and that our members have access to the resources and support they need to succeed.I work day and night to provide value for members at Tenacity, whether it's organizing events, creating educational content, or providing mentorship and guidance. I am dedicated to making a positive impact on the lives of our members and believe in the power of community. I am always open to feedback and suggestions from our members, and my ultimate goal is to empower students to achieve their full potential and to help them develop the skills they need to succeed in their chosen fields.As a community, we are committed to providing a space where students can come together, share their interests and passion, and learn from one another. We believe that by fostering a sense of community and belonging, we can help students to grow and to achieve their full potential.As the founder of Tenacity, I am responsible for managing all aspects of the product and community, including the technology and design end. I take great care to ensure that the community runs smoothly and that our members have access to the resources and support they need to succeed.\nI work day and night to provide value for members at Tenacity, whether it's organizing events, creating educational content, or providing mentorship and guidance. I am dedicated to making a positive impact on the lives of our members and believe in the power of community. I am always open to feedback and suggestions from our members, and my ultimate goal is to empower students to achieve their full potential and to help them develop the skills they need to succeed in their chosen fields.\nAs a community, we are committed to providing a space where students can come together, share their interests and passion, and learn from one another. We believe that by fostering a sense of community and belonging, we can help students to grow and to achieve their full potential.\nRV University\n2 yrs 10 mos\nResearch Associate - Centre For Global Health and Development\nFull-time\nDec 2024 - Present · 8 mosDec 2024 to Present · 8 mos\nPeer Mentor - SoCSE\nPart-time\nJun 2023 - Present · 2 yrs 2 mosJun 2023 to Present · 2 yrs 2 mos\nHybrid\nMentor - Centre For High Performing Systems and Web Technologies\nFull-time\nJun 2024 - Jul 2024 · 2 mosJun 2024 to Jul 2024 · 2 mos\nBengaluru, Karnataka, India · Hybrid\nLetter of Appreciation\nShow all 5 experiences\nCommunity and Growth\nRabble · Full-time\nJun 2024 - Aug 2024 · 3 mosJun 2024 to Aug 2024 · 3 mos\nBengaluru, Karnataka, India · Hybrid\nRabble Labs (Buidlers Tribe + Lumos Labs) provides a comprehensive suite of on chain platforms tailored for dedicated Web3 builders and enthusiasts. Our platforms empower Web3 developers by offering seamless access to talent, capital, distribution channels, and on chain users.Our standout platforms, buidl.so, connects Web3 founders with investors, trusted vendors, partners, advisors, and top-tier talent. With a growing community of over 1,500 founders and 400 investors, buidl.so is the go to resource for fostering impactful collaborations and driving innovation in the Web3 space.Rabble Labs (Buidlers Tribe + Lumos Labs) provides a comprehensive suite of on chain platforms tailored for dedicated Web3 builders and enthusiasts. Our platforms empower Web3 developers by offering seamless access to talent, capital, distribution channels, and on chain users.\nOur standout platforms, buidl.so, connects Web3 founders with investors, trusted vendors, partners, advisors, and top-tier talent. With a growing community of over 1,500 founders and 400 investors, buidl.so is the go to resource for fostering impactful collaborations and driving innovation in the Web3 space.\nGoogle Developer Student Clubs\nGoogle Developer Student Clubs\nJul 2021 - Aug 2024 · 3 yrs 2 mosJul 2021 to Aug 2024 · 3 yrs 2 mos\nShow all 14 experiences\n"
    },
    {
        "id": 5,
        "profile_text_data": "\nEducation\nY Combinator\nStartup School\nJun 2022 - Aug 2022\nRV University\nBachelor of Technology with Honours and Minors, Computer Science Engineering and Fintech\nAug 2023 - Aug 2027\nShow all 6 educations\n"
    },
    {
        "id": 6,
        "profile_text_data": "\nLicenses & certifications\nBig Data 101\nIBM\nIssued Jan 2025\nCredential ID 3d33e322d7044f448542ee8a7eb5593f\nShow credential\nHadoop 101\nIBM\nIssued Jan 2025\nCredential ID c72a626d8a9149ebbde6a26b38d51a79\nShow credential\nShow all 19 licenses & certifications\n"
    },
    {
        "id": 7,
        "profile_text_data": "\nProjects\nProject Astromeda (Google Earth Engine)\nOct 2022 - Present\nShow project\nAstro Bot\nMay 2021 - Present\nAssociated with Astro Bot\nShow project\nAstro Bot is a multipurpose Discord.py bot built for keeping yourDiscord servers organized and making tasks more convenient.Astro Bot is a multipurpose Discord.py bot built for keeping your\nDiscord servers organized and making tasks more convenient.\nMicrosoft Azure\n"
    },
    {
        "id": 8,
        "profile_text_data": "\nVolunteering\nWeb3:Reinvent\nSpheron Network\nScience and Technology\nOrganized India's first and largest decentralized infra conference\nGoogle Maps Local Guide Level 8\nGoogle Maps Street View\nApr 2016 - Present · 9 yrs 4 mos\nShow all 3 volunteer experiences\n"
    },
    {
        "id": 9,
        "profile_text_data": "\nSkills\nMarketing\n3 endorsements\nCommunity Outreach\n3 endorsements\nShow all 48 skills\n"
    },
    {
        "id": 10,
        "profile_text_data": "\nRecommendations\nReceived\nGiven\nNothing to see for now\nRecommendations that Taufeeq receives will appear here.\nSanjay Chitnis\nVice Chancellor, REVA University, Bengaluru\nOctober 9, 2024, Taufeeq reported directly to Sanjay\nI was honoured to study under Dr. Sanjay Chitnis's leadership during his time at RV University. As our dean, his visionary approach and unwavering support for innovative ideas were truly inspiring. Dr. Chitnis encouraged us to think creatively and pursue our passions, significantly shaping both my personal and academic development.Dr. Sanjay Chitnis's exceptional knowledge and insights consistently guided our school (School of Computer Science and Engineering) forward. His ability to embrace innovation and foster an environment of growth made a profound impact on the student community. His mentorship and leadership exemplify how intellect, courage, and kindness can combine to create success for everyone involved.I am deeply grateful for his guidance and feel fortunate to have been his student.I was honoured to study under Dr. Sanjay Chitnis's leadership during his time at RV University. As our dean, his visionary approach and unwavering support for innovative ideas were truly inspiring. Dr. Chitnis encouraged us to think creatively and pursue our passions, significantly shaping both my personal and academic development.\nDr. Sanjay Chitnis's exceptional knowledge and insights consistently guided our school (School of Computer Science and Engineering) forward. His ability to embrace innovation and foster an environment of growth made a profound impact on the student community. His mentorship and leadership exemplify how intellect, courage, and kindness can combine to create success for everyone involved.\nI am deeply grateful for his guidance and feel fortunate to have been his student.\n"
    },
    {
        "id": 11,
        "profile_text_data": "\nPublications\nTenacity Whitepaper\nTenacity · Jan 7, 2023\nShow publication\nAll about community driven education\n"
    },
    {
        "id": 12,
        "profile_text_data": "\nHonors & awards\n20Under20 2024\nIssued by Infosys · Aug 2024\nAssociated with Tenacity\nMission To Mars Student Challenge\nIssued by NASA - National Aeronautics and Space Administration · Feb 2021\nShow all 5 honors & awards\n"
    },
    {
        "id": 13,
        "profile_text_data": "\nLanguages\nEnglish\nNative or bilingual proficiency\nHindi\nFull professional proficiency\nShow all 5 languages\n"
    },
    {
        "id": 14,
        "profile_text_data": "\nInterests\nTop Voices\nCompanies\nGroups\nSchools\nAravind Srinivas\nAravind Srinivas\nCofounder & CEO, Perplexity\n469,850 followers\nFollow\nMustafa Suleyman\nCEO, Microsoft AI\n371,179 followers\nFollow\nShow all Top Voices\nMicrosoft\nMicrosoft\n25,752,464 followers\nFollow\nGoogle\nGoogle\n37,818,556 followers\nFollow\nShow all companies\nMVP Mentorship Circle\n275 members\nJoin\nJoin MVP Mentorship Circle group\nHarvard Business Review Discussion Group\n2,999,994 members\nJoin\nJoin Harvard Business Review Discussion Group group\nShow all groups\nAlchemy University\n10,184 followers\nFollow\nY Combinator\n1,368,688 followers\nFollow\nShow all schools\n"
    },
    {
        "id": 15,
        "profile_text_data": "\nCauses\nScience and Technology • Environment • Children • Animal Welfare • Education • Economic Empowerment • Health\n"
    }
]